import React, {Component} from "react";
import "./enterVia.scss";

export class EnterVia extends Component {
    render() {
        return (
            <div className={'row via'}>
                <div className={"center-column resource"}>
                    <div className="row">
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path d="M23.8281 12C23.8281 5.37258 18.4555 0 11.8281 0C5.2007 0 -0.171875 5.37258 -0.171875 12C-0.171875 17.9895 4.21633 22.954 9.95312 23.8542V15.4687H6.90625V12H9.95312V9.35625C9.95312 6.34875 11.7447 4.6875 14.4857 4.6875C15.7987 4.6875 17.1719 4.92187 17.1719 4.92187V7.875H15.6588C14.1681 7.875 13.7031 8.80008 13.7031 9.74906V12H17.0312L16.4992 15.4687H13.7031V23.8542C19.4399 22.954 23.8281 17.9895 23.8281 12Z" fill="#1877F2"/>
                        </svg>
                        <label className={"enter-via-text"}>Войти через Facebook</label>
                    </div>
                </div>
                <div className={"center-column resource second"}>
                    <div className="row">
                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g clipPath="url(#clip0)">
                                <path d="M23.9998 12.2758C23.9998 11.46 23.9323 10.6399 23.7884 9.8374H12.2405V14.4584H18.8534C18.579 15.9487 17.6973 17.2671 16.4062 18.1049V21.1032H20.3514C22.6682 19.0132 23.9998 15.9267 23.9998 12.2758Z" fill="#4285F4"/>
                                <path d="M12.2406 24.0001C15.5426 24.0001 18.3272 22.9375 20.3561 21.1032L16.4108 18.1048C15.3132 18.8368 13.8961 19.2513 12.2451 19.2513C9.05113 19.2513 6.34297 17.1392 5.37128 14.2996H1.30005V17.3905C3.3784 21.4427 7.61158 24.0001 12.2406 24.0001Z" fill="#34A853"/>
                                <path d="M5.36688 14.2995C4.85404 12.8091 4.85404 11.1953 5.36688 9.70496V6.61401H1.30015C-0.436312 10.0048 -0.436312 13.9996 1.30015 17.3904L5.36688 14.2995Z" fill="#FBBC04"/>
                                <path d="M12.2406 4.74893C13.9861 4.72247 15.6731 5.36623 16.9372 6.54794L20.4326 3.12188C18.2193 1.08477 15.2817 -0.0351984 12.2406 7.62441e-05C7.61158 7.62441e-05 3.3784 2.55749 1.30005 6.61408L5.36678 9.70502C6.33398 6.861 9.04663 4.74893 12.2406 4.74893Z" fill="#EA4335"/>
                            </g>
                            <defs>
                                <clipPath id="clip0">
                                    <rect width="24" height="24" fill="white"/>
                                </clipPath>
                            </defs>
                        </svg>
                        <label className={"enter-via-text"}>Войти через Google</label>
                    </div>
                </div>
            </div>
        );
    }
}
